{
  "selectedTemplate": 7,
  "headings": {
    "work": "Experience",
    "volunteering": "Volunteering",
    "projects": "Projects",
    "education": "Education",
    "skills": "Skills",
    "awards": "Awards",
    "papers": "Papers"
  },
  "basics": {
    "email": "solanosalex@gmail.com",
    "phone": "+30 6945482042",
    "website": "hytromo.github.io",
    "location": {
      "address": "Patras, Greece"
    },
    "name": "Alexandros Solanos"
  },
  "work": [
    {
      "company": "TourPanda",
      "location": "Patras, Greece",
      "position": "Software and Devops Engineer",
      "website": "https://tourpanda.com",
      "highlights": [
        "I worked as Lead of the developer team, managing people and developing software using test-driven development (TDD).",
        "I designed and built a complex, horizontally scalable RESTful API using Node.js.",
        "I created the main custom application-level algorithms for the resource availability, agnostic of resource type and resource characteristics.",
        "I built a RESTful API using Nest.js for analytics purposes.",
        "I developed the booking assistant, the application which end-users book from, and a large part of the dashboard, using React.js.",
        "I transitioned the deployment to Kubernetes, with a staging and a production environment, IaC in GCP and a complex CI/CD pipeline within 2 months, cutting operational costs by over 40 percent and facilitating a faster, fully-automatic and less error prone release cycle, freeing valuable developer time.",
        "I implemented the frontend and the backend of multiple live-update systems based on WebSockets.",
        "I was the Scrum Master in our Agile process, obtaining a deep understanding on the Agile culture and why there are certain practices around it.",
        "I wrote unit, integration and e2e tests (using cypress).",
        "I worked with Node.js, Redis, MongoDB and PostgreSQL in the backend.",
        "I worked with React.js, Next.js and jQuery in the frontend."
      ],
      "startDate": "Sep 2016",
      "endDate": "Present"
    },
    {
      "highlights": [
        "I modernized the processes of the company: from doing data entry and manual comparison using different and inconsistent excel files, the users could now do data entry in a friendly and dynamic web interface which I built. The app was fed all the excel files and could do powerful comparisons of the aggregations of the data between different years, and of course allowed entry of new data. The application freed several man-hours per day and ended up being used years after my departure (and may still be used). The frontend was built in jQuery and the backend used CakePHP and MySQL.",
        "I did generic IT support on Windows-based users."
      ],
      "website": "https://ferrycenter.gr/",
      "company": "Blue Star Ferries Agency",
      "position": "Process streamlining / IT support",
      "location": "Patras, Greece",
      "startDate": "Sep 2014",
      "endDate": "Sep 2016"
    }
  ],
  "education": [
    {
      "location": "Patras, Greece",
      "studyType": "Master's",
      "startDate": "Sep 2012",
      "endDate": "present",
      "institution": "University of Patras",
      "area": "Electrical and Computer Engineering",
      "gpa": "~7 (pending), Thesis: Design and implementation of a prototype IoT system based on containers and the Lightweight M2M protocol"
    }
  ],
  "volunteering": [
    {
      "company": "Ubuntu",
      "position": "Official Ubuntu Member",
      "website": "https://ubuntuforums.org/showthread.php?t=1984130",
      "startDate": "May 2012",
      "endDate": "Present",
      "location": "Online",
      "highlights": [
        "Helping users at the Ubuntu Forums",
        "Helping users at Ask Ubuntu",
        "Reporting posts at the Ubuntu Forums for their better functionality",
        "Bug Reporting at Launchpad and Gnome Bugzilla - testing beta applications",
        "Providing Assistance on IRC Chatrooms",
        "Proposing Ideas at Ubuntu Brainstorm",
        "Developing scripts and helpful programs for the Ubuntu Community",
        "Contributing at community wiki (https://bit.ly/3f0zGRI)",
        "Various open source contributions, like in terser (official webpack minifier) and CakePHP"
      ]
    },
    {
      "company": "TsikiBoom Camping",
      "website": "https://tsikiboom.com",
      "endDate": "Jul 2010",
      "highlights": ["Team activities", "Creative learning"],
      "position": "Assistant to the team leader",
      "location": "Chania, Greece",
      "startDate": "Jun 2010"
    }
  ],
  "skills": [
    {
      "level": "",
      "keywordInfo": {
        "Typescript": {
          "level": 90,
          "moreInfo": "I have worked in large-scale projects for years in Typescript and Javascript. I've worked both in the backend and in the frontend using various frameworks and I also have knowledge about bundlers, like webpack and rollup."
        },
        "Python 2/3": {
          "level": 60,
          "moreInfo": "I have worked a lot of times using python but mostly in order to automate things or build small libraries. I haven't worked in large-scale projects using python. My latest noteworthy experience with it was to automate the deployment of a minikube kubernetes cluster in a development environment and streamlining the development inside it."
        },
        "Bash": {
          "level": 70,
          "moreInfo": "While bash was my first programming language, I try to avoid it in most cases, because complex logic and loops can become awkward fast. My latest experience with bash was using it in order to orchestrate complex CI/CD processes."
        },
        "PHP": {
          "level": 70,
          "moreInfo": "PHP was the first language of the web I learned and I've worked with it with various frameworks (Laravel, CakePHP) as well as vanilla, to better understand its internal workings."
        },
        "C / C++": {
          "level": 60,
          "moreInfo": "C was my second programming language and I learned algorithms and data structures with it. My latest noteworthy experience with it was programming along with a friend a Bosch XDK for an IoT contest organized by Bosch (and we got first place!). C++ can be very complex and thus I can't claim I know it well, but I've built Wallch with it, along with a friend. Wallch made it into the Ubuntu repositories back in 2010, when we were 16. While Wallch was a simple wallpaper changer program, it was developed further as a learning experience: It used multithreading to not block the UI thread while loading images, a caching mechanism to quickly load thumbnails, it could combine pictures (clock-wallpapers) and it accessed the internet to download a \"live\" earth image (built by a third party) and set a live website as desktop background. It also integrated with the (now dead) Ubuntu Unity desktop by utilizing Gtk libraries."
        },
        "Java": {
          "level": 60,
          "moreInfo": "Using Java, I have built NotiSIM for Android, an app that sends an SMS message to a configured phone number if it detects a change in SIM. I also have experience with Java in university, covering OOP and advanced programming techniques like multi-threading, semaphores etc."
        }
      },
      "keywords": [
        "Typescript",
        "Python 2/3",
        "Bash",
        "PHP",
        "C / C++",
        "Java"
      ],
      "name": "Programming Languages"
    },
    {
      "keywords": [
        "Express.js",
        "Next.js",
        "React.js",
        "Nest.js",
        "CakePHP",
        "Qt (C++ and Python)",
        "Gtk 2.0",
        "Various ORMs"
      ],
      "name": "Libs / Frameworks"
    },
    {
      "keywordInfo": {
        "Kubernetes": {
          "level": 70,
          "moreInfo": "I started learning kubernetes out of a necessity to automate the integration and deployment processes in TourPanda. I have used both Google Kubernetes Engine in production and Minikube as a development environment and I've built complex deployment environments inside the cluster, with autoscaling, monitoring, databases and more."
        },
        "Helm": {
          "level": 70,
          "moreInfo": "I've used helm for the templating of kubernetes manifests in production. While I've worked with it a lot, I wouldn't consider myself an expert in authoring helm charts."
        },
        "Helmfile": {
          "level": 80,
          "moreInfo": "I've used helmfile extensively, along with lots of its features, like selectors, environments and subhelmfiles in order to organize, define dependencies and streamline the deployment of helm charts. Helmfile has been used as part of a CI/CD pipeline."
        },
        "Ansible": {
          "level": 40,
          "moreInfo": "I've worked with ansible shortly in order to automate the configuration of VMs in the Cloud, before moving on to kubernetes where ansible wasn't used."
        },
        "Terraform": {
          "level": 80,
          "moreInfo": "I have used terraform as IaC in Digital Ocean and Google Cloud Platform. I have created terraform modules, working in different environments, saving the state in remote backends and referencing remote state. I have also used terraform in CI/CD in order to do infrastructure changes similarly to how we do code changes, creating a unified pipeline."
        }
      },
      "keywords": ["Kubernetes", "Helm", "Helmfile", "Ansible", "Terraform"],
      "name": "Devops tools"
    },
    {
      "keywords": [
        "Lead of developer team",
        "Scrum Master",
        "Interviewing for technical positions",
        "Public speaking"
      ],
      "name": "People"
    },
    {
      "keywordInfo": {
        "Greek (native)": {
          "level": 100
        },
        "English (C2)": {
          "level": 90,
          "moreInfo": "I have obtained the certificate of proficiency in English from the University of Michigan. I am fluent in English and I've been working in an all-english speaking team for 4 years full-time."
        }
      },
      "keywords": ["Greek (native)", "English (C2)"],
      "name": "Languages"
    },
    {
      "keywords": ["VSCode", "Vim", "QtCreator", "Eclipse", "Sublime Text"],
      "name": "Editors"
    }
  ],
  "projects": [
    {
      "name": "Wallch",
      "roleDescription": "I built the support for different desktop environments, the main UI, the caching mechanism, the live website feature, the live earth image feature, multi-threading for not blocking the UI thread, the CLI interface that allowed for advanced scripting, the Unity desktop integration and more.",
      "keywords": ["C++ / Qt"],
      "description": "A first C++ GUI experiment that made its way into the official Ubuntu repositories (2010); a wallpaper changer. A big learning project for a lot of things around building software. Built along with a classmate.",
      "url": "https://launchpad.net/wallpaper-changer",
      "pictures": [
        {
          "isAnimated": false,
          "alt": "The main Wallch window",
          "description": "The main Wallch window, following the then-style of Ubuntu Software Center"
        },
        {
          "isAnimated": false,
          "alt": "The wallpaper clocks feature",
          "description": "The wallpaper clocks feature, on the left you can see the Unity integration"
        },
        {
          "isAnimated": false,
          "alt": "The live website feature",
          "description": "The live website feature, allowing you to set a non-interactive website as desktop background, giving the ability to crop a part of it as well as provide login details for password protected websites"
        },
        {
          "isAnimated": false,
          "alt": "The preferences dialog",
          "description": "The preferences dialog, with a wide range of options"
        }
      ]
    },
    {
      "keywords": ["PHP / CakePHP", "MySQL"],
      "name": "MalvaGallery",
      "roleDescription": "I am the sole author of this project. I built the whole website, which includes \"infinite scrolling\" on the paintings, a RESTful API for users and paintings management and using an ImageMagick-based script to automatically add the trademark logo on the uploaded images.",
      "description": "A simple website built with CakePHP for my artist uncle. A learning project for web development which also features users and paintings management.",
      "url": "https://malvagallery.com/",
      "pictures": [
        {
          "isAnimated": false,
          "alt": "The main view of the website",
          "description": "The view of the website the visitor is greeted with, after reading the introductory text."
        },
        {
          "isAnimated": false,
          "alt": "Browsing the paintings",
          "description": "Browsing the paintings, featuring infinite scrolling."
        },
        {
          "isAnimated": false,
          "alt": "Seeing details of a painting",
          "description": "Seeing details of a painting by clicking on it."
        },
        {
          "isAnimated": false,
          "alt": "The \"Edit Painting\" view of the management dashboard",
          "description": "The \"Edit Painting\" view of the website management dashboard"
        }
      ]
    },
    {
      "keywords": ["PHP / CakePHP", "MySQL"],
      "name": "University Department E-class",
      "roleDescription": "I built about half of each section of the project (MVC architecture)",
      "url": "https://github.com/themetalfleece/university-department-eclass-project",
      "description": "An open e-class clone (https://www.openeclass.org/en/); a university project. Co-created along with another university student.",
      "pictures": [
        {
          "isAnimated": false,
          "alt": "Viewing the usage of a classroom",
          "description": "Viewing the usage of a classroom"
        },
        {
          "isAnimated": false,
          "alt": "Enrolled courses view of a student",
          "description": "Enrolled courses view of a student"
        },
        {
          "isAnimated": false,
          "alt": "Course management (secretary view)",
          "description": "Course management (secretary view)"
        },
        {
          "isAnimated": false,
          "alt": "Enrolled courses schedule (student view)",
          "description": "Enrolled courses schedule (student view)"
        }
      ]
    },
    {
      "keywords": ["Java", "Android"],
      "name": "NotiSIM",
      "roleDescription": "I built this project as an alternative way to protect your phone",
      "description": "NotiSIM will send an SMS message to a number of your preference when it detects that your SIM card has changed. That way you can easily get the phone number of the newly inserted SIM card, in case your phone is stolen. The application supports white-listing any number of SIM cards, so 2 or more people can use the same phone with different SIM cards. Note that the application runs only on boot for detecting SIM changes and thus it does not run constantly, draining your battery.",
      "pictures": [
        {
          "isAnimated": false,
          "alt": "The setup screen where you can input the number to send the message to and the message itself",
          "description": "The setup screen where you can input the number to send the message to and the message itself"
        },
        {
          "isAnimated": false,
          "alt": "The screen that allows you to change the whitelisted SIMs",
          "description": "The screen that allows you to change the whitelisted SIMs"
        }
      ]
    },
    {
      "keywords": ["Python 2 / Qt"],
      "name": "MacroPolo",
      "description": "A python module that can be used in order to automate high-level processes (macros)",
      "roleDescription": "I built this project to automate some high level tasks that did not provide an API.",
      "url": "https://github.com/hytromo/MacroPolo",
      "pictures": [
        {
          "alt": "A basic text macro giving terminal commands",
          "description": "A basic text macro giving terminal commands",
          "isAnimated": true
        },
        {
          "alt": "A more advanced example, finding a tool in Gimp by its color and drawing a circle with it",
          "description": "A more advanced example, finding a tool in Gimp by its color and drawing a circle with it",
          "isAnimated": true
        }
      ]
    },
    {
      "keywords": ["C++ / Qt"],
      "name": "Anem",
      "roleDescription": "I built both the graph generator and the mostly-static website for this project.",
      "description": "A graph generator that combined the powers of C++, ImageMagick and rrdtool to generate graphs regarding the power output, wind direction and wind speed of wind turbines. This side-project is dating back to 2013 and it wasn't intended for production use but it ended up being used for years by Petrogaz (https://www.petrogaz.gr/en/). Sadly the project got discontinued.",
      "url": "https://github.com/hytromo/anem",
      "pictures": [
        {
          "alt": "The main website view, with the first 2 images that are being generated by the data receiver, wind speed and wind direction",
          "description": "The main website view, with the first 2 images that are being generated by the data receiver, wind speed and wind direction",
          "isAnimated": false
        },
        {
          "alt": "More graphs that are being generated by the data receiver and shown in the mostly static website",
          "description": "More graphs that are being generated by the data receiver and shown in the mostly static website",
          "isAnimated": false
        }
      ]
    },
    {
      "keywords": ["Python 3"],
      "name": "python-digitalocean-ssh",
      "description": "A CLI-only python project aimed to make DO VMs easily accessible via ssh at any time.",
      "url": "https://github.com/hytromo/python-digitalocean-ssh"
    }
  ],
  "papers": [
    {
      "name": "Cyber-Physical Microservices: An IoT-based Framework for Manufacturing Systems",
      "description": "Conference: 1st IEEE International Conference on Industrial Cyber-Physical Systems (ICPS 2018), Saint Petersburg, Russia, May 15-18, 2018.",
      "url": "https://bit.ly/2BXPLsz",
      "keywords": []
    }
  ],
  "awards": [
    {
      "title": "Bosch XDK Ideation Jam Winner",
      "date": " Aug 2016",
      "awarder": "Bosch",
      "summary": "Our team's project was deemed to be the best on using Bosch's XDK in an internet of things application: https://bit.ly/2YZZ3xr"
    }
  ],
  "sections": [
    "templates",
    "profile",
    "work",
    "education",
    "skills",
    "projects",
    "awards",
    "volunteering",
    "papers"
  ]
}
